src/main/test/supply-chain/0-Validation/0-Apply Tax/1-01_01_02_Grouping_Validations/5-TC01.01.02.06_Lines_validation/0-TC01.01.02.06_01_Lines_validation/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <!--Optional:-->
		<arg0>
		<DocumentId>
    <SystemSourceId>ICI001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CUSTOM_01</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces/>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
    <SellerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </SellerTaxTotal>
    <BuyerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </BuyerTaxTotal>
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      <SellerLocalTaxCurrencyExchangeRate/>
      <SellerLocalTaxCurrencyCode/>
      <BuyerLocalTaxCurrencyExchangeRate/>
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>56000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      <SellerTax>
       
      </SellerTax>
     <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>3101</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>3110</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>Y</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>Y</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
      <BuyerTax>
        
      </BuyerTax>
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>2</ItemNo>
      <ItemType/>
      <UNSPSC>30000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      <SellerTax>
       
      </SellerTax>
     <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>3101</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>3110</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose/>
    <IsOutBonded/>
    <IsInBonded/>
    <TaxPreAlgorithmOutput>
      <IsExport/>
      <IsImport/>
      <IsExported/>
      <IsImported/>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
      <BuyerTax>
        
      </BuyerTax>
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>3</LineNumber>
      <ItemNo>3</ItemNo>
      <ItemType/>
      <UNSPSC>78000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      <SellerTax>
       
      </SellerTax>
     <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>3101</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>3110</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry>CA</ServiceRenderedCountry>
    <ServiceRenderedState>CAON</ServiceRenderedState>
    <ResalePurpose/>
    <IsOutBonded/>
    <IsInBonded/>
    <TaxPreAlgorithmOutput>
      <IsExport/>
      <IsImport/>
      <IsExported/>
      <IsImported/>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
      <BuyerTax>
        
      </BuyerTax>
    </TaxInvoiceLine>
    <TaxInvoiceLine>
      <LineNumber>4</LineNumber>
      <ItemNo>4</ItemNo>
      <ItemType/>
      <UNSPSC>40000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      <SellerTax>
       
      </SellerTax>
     <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>3101</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>3110</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry>CA</ServiceRenderedCountry>
    <ServiceRenderedState>CAON</ServiceRenderedState>
    <ResalePurpose/>
    <IsOutBonded/>
    <IsInBonded/>
    <TaxPreAlgorithmOutput>
      <IsExport/>
      <IsImport/>
      <IsExported/>
      <IsImported/>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
      <BuyerTax>
        
      </BuyerTax>
    </TaxInvoiceLine>
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2014-06-12</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
  
  <BuyerParty>
    <Party>
      <BusinessUnitCode>7522</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>FR</CountryCode>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
   
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>9000</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
     <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>DE</CountryCode>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery>
  </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>